<?xml version="1.0"?>
<net name="Model3" version="11">
	<layers>
		<layer id="2" name="sample" type="Parameter" version="opset1">
			<data shape="?,4,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="sample">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="timestep" type="Parameter" version="opset1">
			<data shape="?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="timestep">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="encoder_hidden_states" type="Parameter" version="opset1">
			<data shape="?,77,768" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="encoder_hidden_states">
					<dim>-1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.conv_in.weight" type="Const" version="opset1">
			<data element_type="u8" shape="320, 4, 3, 3" offset="0" size="11520" />
			<output>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Convert_1637499" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="self.conv_in.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="320, 1, 1, 1" offset="11520" size="320" />
			<output>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Convert_1637502" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="self.conv_in.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>320</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="self.conv_in.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="320, 1, 1, 1" offset="11840" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="self.conv_in.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>320</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="self.conv_in.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.conv_in/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.conv_in/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 320, 1, 1" offset="12480" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.conv_in/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="145,input.7">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="self.down_blocks.0.resnets.0.norm1.weight" type="Const" version="opset1">
			<data element_type="f32" shape="320" offset="13760" size="1280" />
			<output>
				<port id="0" precision="FP32" names="self.down_blocks.0.resnets.0.norm1.weight">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="self.down_blocks.0.resnets.0.norm1.bias" type="Const" version="opset1">
			<data element_type="f32" shape="320" offset="15040" size="1280" />
			<output>
				<port id="0" precision="FP32" names="self.down_blocks.0.resnets.0.norm1.bias">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.down_blocks.0.resnets.0.norm1/aten::group_norm/GroupNormalization" type="GroupNormalization" version="opset12">
			<data num_groups="32" epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="184,input.9">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.down_blocks.0.resnets.0.nonlinearity/aten::silu/Swish" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="185,input.11">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.down_blocks.0.resnets.0.conv1.weight" type="Const" version="opset1">
			<data element_type="u8" shape="320, 320, 3, 3" offset="16320" size="921600" />
			<output>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Convert_1053379" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="self.down_blocks.0.resnets.0.conv1.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="320, 1, 1, 1" offset="937920" size="320" />
			<output>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convert_1053382" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="self.down_blocks.0.resnets.0.conv1.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="self.down_blocks.0.resnets.0.conv1.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="320, 1, 1, 1" offset="938240" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="self.down_blocks.0.resnets.0.conv1.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="self.down_blocks.0.resnets.0.conv1.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.down_blocks.0.resnets.0.conv1/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.down_blocks.0.resnets.0.conv1/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 320, 1, 1" offset="938880" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.down_blocks.0.resnets.0.conv1/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="192,hidden_states.1">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ShapeOf_80761" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_80762" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="940160" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_80763" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="940160" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="32" name="Gather_80764" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="1121,1124,1161,1205,1321,1324,1361,1405,1654,1657,1694,1738,2125,2128,2165,2209,221,224,2336,2339,2376,2420,2547,2550,2587,261,2631,28,2801,2804,2841,2885,30,3012,3015,305,3052,3096,3223,3226,3263,3307,3475,3478,3515,3559,3686,3689,3726,3770,3897,3900,3937,3981,421,424,461,505,671,674,711,755,871,874,911,955">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="108,33,timesteps">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="94" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="940168" size="8" />
			<output>
				<port id="0" precision="I64" names="94" />
			</output>
		</layer>
		<layer id="35" name="__module.time_proj/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="109">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.time_proj/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="110">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.time_proj/aten::slice/Slice_1" type="Const" version="opset1">
			<data element_type="f32" shape="1, 160" offset="940176" size="640" />
			<output>
				<port id="0" precision="FP32" names="112">
					<dim>1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.time_proj/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="113,114,emb.3,emb.5">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.time_proj/aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="115">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.time_proj/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="116">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.time_proj/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="118,119,121,emb">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_17570" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="940816" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_17572" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="940824" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_17574" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="940168" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_17568" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="940168" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.time_proj/aten::slice/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="120">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_17590" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="940160" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_17592" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="940816" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_17594" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="940168" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_17588" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="940168" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.time_proj/aten::slice/Slice_5" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="122">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.time_proj/aten::cat/Concat_1" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="124,39,input.1,t_emb">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="self.time_embedding.linear_1.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 320" offset="940832" size="409600" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Convert_1186524" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="self.time_embedding.linear_1.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="1350432" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Convert_1186527" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="self.time_embedding.linear_1.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="self.time_embedding.linear_1.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="1351712" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="self.time_embedding.linear_1.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="self.time_embedding.linear_1.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.time_embedding.linear_1/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_78238" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1280" offset="1354272" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.time_embedding.linear_1/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="130,input.3">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.time_embedding.act/aten::silu/Swish" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="131,input.5">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="self.time_embedding.linear_2.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="1359392" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Convert_714074" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="self.time_embedding.linear_2.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="2997792" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Convert_714077" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="self.time_embedding.linear_2.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="self.time_embedding.linear_2.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="2999072" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="self.time_embedding.linear_2.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="self.time_embedding.linear_2.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.time_embedding.linear_2/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_78239" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1280" offset="3001632" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.time_embedding.linear_2/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="134,input.13">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.down_blocks.0.resnets.0.nonlinearity/aten::silu/Swish_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1082,1293,1517,1558,1626,1826,1890,193,1942,1994,2089,2300,2511,2765,2976,3187,3439,3650,3861,393,632,843,input.137,input.15,input.177,input.219,input.259,input.275,input.291,input.331,input.347,input.365,input.383,input.403,input.445,input.487,input.531,input.55,input.573,input.615,input.659,input.701,input.743,input.95">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="self.down_blocks.0.resnets.0.time_emb_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="320, 1280" offset="3006752" size="409600" />
			<output>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Convert_1199409" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="self.down_blocks.0.resnets.0.time_emb_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="320, 1" offset="3416352" size="320" />
			<output>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Convert_1199412" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="self.down_blocks.0.resnets.0.time_emb_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="self.down_blocks.0.resnets.0.time_emb_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="320, 1" offset="3416672" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="self.down_blocks.0.resnets.0.time_emb_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="self.down_blocks.0.resnets.0.time_emb_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.down_blocks.0.resnets.0.time_emb_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_78240" type="Const" version="opset1">
			<data element_type="f32" shape="1, 320" offset="3417312" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.down_blocks.0.resnets.0.time_emb_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="196,197,198">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="161" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3418592" size="8" />
			<output>
				<port id="0" precision="I64" names="161" />
			</output>
		</layer>
		<layer id="89" name="__module.down_blocks.0.resnets.0/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="199">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="162" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3418600" size="8" />
			<output>
				<port id="0" precision="I64" names="162" />
			</output>
		</layer>
		<layer id="91" name="__module.down_blocks.0.resnets.0/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="200,temb.1">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.down_blocks.0.resnets.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="201,input.17">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="self.down_blocks.0.resnets.0.norm2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="320" offset="3418608" size="1280" />
			<output>
				<port id="0" precision="FP32" names="self.down_blocks.0.resnets.0.norm2.weight">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="self.down_blocks.0.resnets.0.norm2.bias" type="Const" version="opset1">
			<data element_type="f32" shape="320" offset="3419888" size="1280" />
			<output>
				<port id="0" precision="FP32" names="self.down_blocks.0.resnets.0.norm2.bias">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.down_blocks.0.resnets.0.norm2/aten::group_norm/GroupNormalization" type="GroupNormalization" version="opset12">
			<data num_groups="32" epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="204,input.19">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.down_blocks.0.resnets.0.nonlinearity/aten::silu/Swish_2" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="205,input.21">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="self.down_blocks.0.resnets.0.conv2.weight" type="Const" version="opset1">
			<data element_type="u8" shape="320, 320, 3, 3" offset="3421168" size="921600" />
			<output>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Convert_1057674" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="self.down_blocks.0.resnets.0.conv2.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="320, 1, 1, 1" offset="4342768" size="320" />
			<output>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Convert_1057677" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="self.down_blocks.0.resnets.0.conv2.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="self.down_blocks.0.resnets.0.conv2.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="320, 1, 1, 1" offset="4343088" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="self.down_blocks.0.resnets.0.conv2.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="self.down_blocks.0.resnets.0.conv2.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.down_blocks.0.resnets.0.conv2/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.down_blocks.0.resnets.0.conv2/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 320, 1, 1" offset="4343728" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.down_blocks.0.resnets.0.conv2/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="213,hidden_states.3">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.down_blocks.0.resnets.0/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="214,215,hidden_states.5">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="self.down_blocks.0.attentions.0.norm.weight" type="Const" version="opset1">
			<data element_type="f32" shape="320" offset="4345008" size="1280" />
			<output>
				<port id="0" precision="FP32" names="self.down_blocks.0.attentions.0.norm.weight">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="self.down_blocks.0.attentions.0.norm.bias" type="Const" version="opset1">
			<data element_type="f32" shape="320" offset="4346288" size="1280" />
			<output>
				<port id="0" precision="FP32" names="self.down_blocks.0.attentions.0.norm.bias">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.down_blocks.0.attentions.0.norm/aten::group_norm/GroupNormalization" type="GroupNormalization" version="opset12">
			<data num_groups="32" epsilon="9.9999999747524271e-07" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="231,input.25">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="self.down_blocks.0.attentions.0.proj_in.weight" type="Const" version="opset1">
			<data element_type="u8" shape="320, 320, 1, 1" offset="4347568" size="102400" />
			<output>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Convert_1465699" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="self.down_blocks.0.attentions.0.proj_in.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="320, 1, 1, 1" offset="4449968" size="320" />
			<output>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Convert_1465702" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="self.down_blocks.0.attentions.0.proj_in.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="self.down_blocks.0.attentions.0.proj_in.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="320, 1, 1, 1" offset="4450288" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="self.down_blocks.0.attentions.0.proj_in.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="self.down_blocks.0.attentions.0.proj_in.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="__module.down_blocks.0.attentions.0.proj_in/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="__module.down_blocks.0.attentions.0.proj_in/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 320, 1, 1" offset="4450928" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.down_blocks.0.attentions.0.proj_in/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="238,hidden_states.7">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
