<?xml version="1.0"?>
<net name="tokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_102668" type="Parameter" version="opset1">
			<data shape="?" element_type="string" />
			<output>
				<port id="0" precision="STRING" names="Parameter_102668">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_102789" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="Constant_102790" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="3" name="Constant_102791" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="8" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_102674" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="5" name="StringTensorUnpack_102669" type="StringTensorUnpack" version="opset15">
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="ShapeOf_102670" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_102671" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Constant_102672" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="9" name="Gather_102673" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="10" name="Constant_102675" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="Range_102676" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_102677" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="13" name="Constant_102678" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="14" name="Add_102679" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="15" name="Constant_102680" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Range_102681" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_102743" type="Const" version="opset1">
			<data element_type="u8" shape="41" offset="28" size="41" />
			<output>
				<port id="0" precision="U8">
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="SpecialTokensSplit_102744" type="SpecialTokensSplit" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>41</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="11" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="CharsMapNormalization_102745" type="CharsMapNormalization" version="extension">
			<data add_dummy_prefix="false" remove_extra_whitespaces="false" escape_whitespaces="false" normalization_form="nfc" case_fold="true" nmt="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="BOOL">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="7" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_102747" type="Const" version="opset1">
			<data element_type="u8" shape="3" offset="69" size="3" />
			<output>
				<port id="0" precision="U8">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_102749" type="Const" version="opset1">
			<data element_type="u8" shape="1" offset="72" size="1" />
			<output>
				<port id="0" precision="U8">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="RegexNormalization_102750" type="RegexNormalization" version="extension">
			<data global_replace="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>3</dim>
				</port>
				<port id="5" precision="U8">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="9" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_102752" type="Const" version="opset1">
			<data element_type="u8" shape="57" offset="73" size="57" />
			<output>
				<port id="0" precision="U8">
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="RegexSplit_102753" type="RegexSplit" version="extension">
			<data behaviour="remove" invert="true" max_splits="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="12" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_102755" type="Const" version="opset1">
			<data element_type="u8" shape="74" offset="130" size="74" />
			<output>
				<port id="0" precision="U8">
					<dim>74</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="RegexSplit_102756" type="RegexSplit" version="extension">
			<data behaviour="isolate" invert="false" max_splits="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>74</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="12" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_102758" type="Const" version="opset1">
			<data element_type="i32" shape="49408" offset="204" size="197632" />
			<output>
				<port id="0" precision="I32">
					<dim>49408</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_102760" type="Const" version="opset1">
			<data element_type="i32" shape="49408" offset="197836" size="197632" />
			<output>
				<port id="0" precision="I32">
					<dim>49408</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_102762" type="Const" version="opset1">
			<data element_type="u8" shape="419070" offset="395468" size="419070" />
			<output>
				<port id="0" precision="U8">
					<dim>419070</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_102770" type="Const" version="opset1">
			<data element_type="i32" shape="48894" offset="814538" size="195576" />
			<output>
				<port id="0" precision="I32">
					<dim>48894</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_102772" type="Const" version="opset1">
			<data element_type="i32" shape="48894" offset="1010114" size="195576" />
			<output>
				<port id="0" precision="I32">
					<dim>48894</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_102774" type="Const" version="opset1">
			<data element_type="u8" shape="145154" offset="1205690" size="145154" />
			<output>
				<port id="0" precision="U8">
					<dim>145154</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_102776" type="Const" version="opset1">
			<data element_type="i32" shape="48894" offset="1350844" size="195576" />
			<output>
				<port id="0" precision="I32">
					<dim>48894</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_102778" type="Const" version="opset1">
			<data element_type="i32" shape="48894" offset="1546420" size="195576" />
			<output>
				<port id="0" precision="I32">
					<dim>48894</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_102780" type="Const" version="opset1">
			<data element_type="u8" shape="272352" offset="1741996" size="272352" />
			<output>
				<port id="0" precision="U8">
					<dim>272352</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_102764" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2014348" size="8" />
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_102766" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2014356" size="8" />
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_102768" type="Const" version="opset1">
			<data element_type="u8" shape="28" offset="2014364" size="28" />
			<output>
				<port id="0" precision="U8">
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_102781" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2014392" size="8" />
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="BPETokenizer_102782" type="BPETokenizer" version="extension">
			<data unk_token="&lt;|endoftext|>" fuse_unk="false" suffix_indicator="" end_suffix="&lt;/w>" byte_fallback="false" cache_capacity="20000" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>49408</dim>
				</port>
				<port id="6" precision="I32">
					<dim>49408</dim>
				</port>
				<port id="7" precision="U8">
					<dim>419070</dim>
				</port>
				<port id="8" precision="I32">
					<dim>48894</dim>
				</port>
				<port id="9" precision="I32">
					<dim>48894</dim>
				</port>
				<port id="10" precision="U8">
					<dim>145154</dim>
				</port>
				<port id="11" precision="I32">
					<dim>48894</dim>
				</port>
				<port id="12" precision="I32">
					<dim>48894</dim>
				</port>
				<port id="13" precision="U8">
					<dim>272352</dim>
				</port>
				<port id="14" precision="I32">
					<dim>2</dim>
				</port>
				<port id="15" precision="I32">
					<dim>2</dim>
				</port>
				<port id="16" precision="U8">
					<dim>28</dim>
				</port>
				<port id="17" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="18" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="19" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="20" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_102783" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2014400" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="42" name="Constant_102785" type="Const" version="opset1">
			<data element_type="u8" shape="5" offset="2014404" size="5" />
			<output>
				<port id="0" precision="U8">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_102787" type="Const" version="opset1">
			<data element_type="u8" shape="13" offset="2014409" size="13" />
			<output>
				<port id="0" precision="U8">
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Truncate_102788" type="Truncate" version="extension">
			<data m_num_inputs="1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="U8">
					<dim>5</dim>
				</port>
				<port id="5" precision="U8">
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_102792" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="46" name="Constant_102793" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="47" name="Constant_102794" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2014422" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_102795" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="2014426" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="CombineSegments_102796" type="CombineSegments" version="extension">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32" />
				<port id="7" precision="I32" />
				<port id="8" precision="I32">
					<dim>1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="12" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="13" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="14" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="15" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Subtract_102797" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_102798" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="52" name="ReduceMax_102799" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="53" name="Constant_102800" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2014422" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="54" name="RaggedToDense_102801" type="RaggedToDense" version="extension">
			<data pad_right="true" m_pad_max_length="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Convert_102802" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Convert_102802.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="RaggedToDense_102801.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Result_102805" type="Result" version="opset1" output_names="input_ids">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
		<layer id="57" name="Result_102807" type="Result" version="opset1" output_names="attention_mask">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="49" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="49" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="49" to-port="2" />
		<edge from-layer="4" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="5" from-port="3" to-layer="18" to-port="4" />
		<edge from-layer="5" from-port="2" to-layer="18" to-port="3" />
		<edge from-layer="5" from-port="1" to-layer="18" to-port="2" />
		<edge from-layer="6" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="2" />
		<edge from-layer="9" from-port="3" to-layer="11" to-port="1" />
		<edge from-layer="9" from-port="3" to-layer="14" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="2" />
		<edge from-layer="11" from-port="3" to-layer="18" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="16" to-port="1" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="2" />
		<edge from-layer="16" from-port="3" to-layer="18" to-port="1" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="5" />
		<edge from-layer="18" from-port="8" to-layer="19" to-port="0" />
		<edge from-layer="18" from-port="9" to-layer="19" to-port="1" />
		<edge from-layer="18" from-port="10" to-layer="19" to-port="2" />
		<edge from-layer="18" from-port="11" to-layer="19" to-port="3" />
		<edge from-layer="18" from-port="7" to-layer="24" to-port="1" />
		<edge from-layer="18" from-port="6" to-layer="24" to-port="0" />
		<edge from-layer="19" from-port="6" to-layer="22" to-port="2" />
		<edge from-layer="19" from-port="7" to-layer="22" to-port="3" />
		<edge from-layer="19" from-port="5" to-layer="22" to-port="1" />
		<edge from-layer="19" from-port="4" to-layer="22" to-port="0" />
		<edge from-layer="20" from-port="0" to-layer="22" to-port="4" />
		<edge from-layer="21" from-port="0" to-layer="22" to-port="5" />
		<edge from-layer="22" from-port="9" to-layer="24" to-port="5" />
		<edge from-layer="22" from-port="8" to-layer="24" to-port="4" />
		<edge from-layer="22" from-port="7" to-layer="24" to-port="3" />
		<edge from-layer="22" from-port="6" to-layer="24" to-port="2" />
		<edge from-layer="23" from-port="0" to-layer="24" to-port="6" />
		<edge from-layer="24" from-port="7" to-layer="26" to-port="0" />
		<edge from-layer="24" from-port="8" to-layer="26" to-port="1" />
		<edge from-layer="24" from-port="9" to-layer="26" to-port="2" />
		<edge from-layer="24" from-port="10" to-layer="26" to-port="3" />
		<edge from-layer="24" from-port="11" to-layer="26" to-port="4" />
		<edge from-layer="24" from-port="12" to-layer="26" to-port="5" />
		<edge from-layer="25" from-port="0" to-layer="26" to-port="6" />
		<edge from-layer="26" from-port="9" to-layer="40" to-port="2" />
		<edge from-layer="26" from-port="11" to-layer="40" to-port="4" />
		<edge from-layer="26" from-port="7" to-layer="40" to-port="0" />
		<edge from-layer="26" from-port="8" to-layer="40" to-port="1" />
		<edge from-layer="26" from-port="10" to-layer="40" to-port="3" />
		<edge from-layer="27" from-port="0" to-layer="40" to-port="5" />
		<edge from-layer="28" from-port="0" to-layer="40" to-port="6" />
		<edge from-layer="29" from-port="0" to-layer="40" to-port="7" />
		<edge from-layer="30" from-port="0" to-layer="40" to-port="8" />
		<edge from-layer="31" from-port="0" to-layer="40" to-port="9" />
		<edge from-layer="32" from-port="0" to-layer="40" to-port="10" />
		<edge from-layer="33" from-port="0" to-layer="40" to-port="11" />
		<edge from-layer="34" from-port="0" to-layer="40" to-port="12" />
		<edge from-layer="35" from-port="0" to-layer="40" to-port="13" />
		<edge from-layer="36" from-port="0" to-layer="40" to-port="14" />
		<edge from-layer="37" from-port="0" to-layer="40" to-port="15" />
		<edge from-layer="38" from-port="0" to-layer="40" to-port="16" />
		<edge from-layer="39" from-port="0" to-layer="40" to-port="17" />
		<edge from-layer="40" from-port="18" to-layer="44" to-port="0" />
		<edge from-layer="40" from-port="19" to-layer="44" to-port="1" />
		<edge from-layer="40" from-port="20" to-layer="44" to-port="2" />
		<edge from-layer="41" from-port="0" to-layer="44" to-port="3" />
		<edge from-layer="42" from-port="0" to-layer="44" to-port="4" />
		<edge from-layer="43" from-port="0" to-layer="44" to-port="5" />
		<edge from-layer="44" from-port="8" to-layer="49" to-port="5" />
		<edge from-layer="44" from-port="7" to-layer="49" to-port="4" />
		<edge from-layer="44" from-port="6" to-layer="49" to-port="3" />
		<edge from-layer="45" from-port="0" to-layer="49" to-port="6" />
		<edge from-layer="46" from-port="0" to-layer="49" to-port="7" />
		<edge from-layer="47" from-port="0" to-layer="49" to-port="8" />
		<edge from-layer="48" from-port="0" to-layer="49" to-port="9" />
		<edge from-layer="49" from-port="10" to-layer="54" to-port="0" />
		<edge from-layer="49" from-port="12" to-layer="54" to-port="2" />
		<edge from-layer="49" from-port="11" to-layer="54" to-port="1" />
		<edge from-layer="49" from-port="10" to-layer="50" to-port="1" />
		<edge from-layer="49" from-port="11" to-layer="50" to-port="0" />
		<edge from-layer="50" from-port="2" to-layer="52" to-port="0" />
		<edge from-layer="51" from-port="0" to-layer="52" to-port="1" />
		<edge from-layer="52" from-port="2" to-layer="54" to-port="3" />
		<edge from-layer="53" from-port="0" to-layer="54" to-port="4" />
		<edge from-layer="54" from-port="6" to-layer="55" to-port="0" />
		<edge from-layer="54" from-port="5" to-layer="58" to-port="0" />
		<edge from-layer="55" from-port="1" to-layer="56" to-port="0" />
		<edge from-layer="56" from-port="1" to-layer="57" to-port="0" />
		<edge from-layer="58" from-port="1" to-layer="59" to-port="0" />
	</edges>
	<rt_info>
		<add_attention_mask value="True" />
		<add_prefix_space />
		<add_special_tokens value="True" />
		<bos_token_id value="49406" />
		<clean_up_tokenization_spaces />
		<detokenizer_input_type value="i64" />
		<eos_token_id value="49407" />
		<handle_special_tokens_with_re />
		<max_length />
		<number_of_inputs value="1" />
		<openvino_tokenizers_version value="2025.2.0.1-567-7885335c24b" />
		<openvino_version value="2025.2.0-19140-c01cd93e24d-releases/2025/2" />
		<original_post_processor_template value="{&quot;type&quot;: &quot;RobertaProcessing&quot;, &quot;sep&quot;: [&quot;&lt;|endoftext|>&quot;, 49407], &quot;cls&quot;: [&quot;&lt;|startoftext|>&quot;, 49406], &quot;trim_offsets&quot;: false, &quot;add_prefix_space&quot;: false}" />
		<original_tokenizer_class value="&lt;class 'transformers.models.clip.tokenization_clip_fast.CLIPTokenizerFast'>" />
		<pad_token_id value="49407" />
		<sentencepiece_version value="0.2.0" />
		<skip_special_tokens value="True" />
		<streaming_detokenizer value="False" />
		<tiktoken_version value="0.9.0" />
		<tokenizer_output_type value="i64" />
		<tokenizers_version value="0.21.4" />
		<transformers_version value="4.53.3" />
		<use_max_padding value="False" />
		<use_sentencepiece_backend value="False" />
		<utf8_replace_mode value="replace" />
		<with_detokenizer value="True" />
	</rt_info>
</net>
