<?xml version="1.0"?>
<net name="detokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_102808" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="Parameter_102808">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Convert_103008" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_102810" type="Const" version="opset1">
			<data element_type="i32" shape="49408" offset="0" size="197632" />
			<output>
				<port id="0" precision="I32">
					<dim>49408</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_102812" type="Const" version="opset1">
			<data element_type="i32" shape="49408" offset="197632" size="197632" />
			<output>
				<port id="0" precision="I32">
					<dim>49408</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_102814" type="Const" version="opset1">
			<data element_type="u8" shape="419070" offset="395264" size="419070" />
			<output>
				<port id="0" precision="U8">
					<dim>419070</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Slice_102819" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="814334" size="8" />
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="VocabDecoder_102821" type="VocabDecoder" version="extension">
			<data skip_tokens="" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>49408</dim>
				</port>
				<port id="2" precision="I32">
					<dim>49408</dim>
				</port>
				<port id="3" precision="U8">
					<dim>419070</dim>
				</port>
				<port id="4" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="FuzeRagged_102822" type="FuzeRagged" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="UTF8Validate_102823" type="UTF8Validate" version="extension">
			<data replace_mode="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_102825" type="Const" version="opset1">
			<data element_type="u8" shape="4" offset="814342" size="4" />
			<output>
				<port id="0" precision="U8">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_102827" type="Const" version="opset1">
			<data element_type="u8" shape="1" offset="814346" size="1" />
			<output>
				<port id="0" precision="U8">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="RegexNormalization_102828" type="RegexNormalization" version="extension">
			<data global_replace="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>4</dim>
				</port>
				<port id="4" precision="U8">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_102830" type="Const" version="opset1">
			<data element_type="u8" shape="2" offset="814347" size="2" />
			<output>
				<port id="0" precision="U8">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_102832" type="Const" version="opset1">
			<data element_type="u8" shape="0" offset="814349" size="1" />
			<output>
				<port id="0" precision="U8">
					<dim>0</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="RegexNormalization_102833" type="RegexNormalization" version="extension">
			<data global_replace="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>2</dim>
				</port>
				<port id="4" precision="U8">
					<dim>0</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StringTensorPack_102834" type="StringTensorPack" version="opset15">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="STRING" names="Result_102835,string_output">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Result_102835" type="Result" version="opset1" output_names="Result_102835,string_output">
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
		<edge from-layer="1" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="6" to-port="2" />
		<edge from-layer="4" from-port="0" to-layer="6" to-port="3" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="4" />
		<edge from-layer="6" from-port="5" to-layer="7" to-port="0" />
		<edge from-layer="6" from-port="6" to-layer="7" to-port="1" />
		<edge from-layer="6" from-port="7" to-layer="7" to-port="2" />
		<edge from-layer="6" from-port="8" to-layer="7" to-port="3" />
		<edge from-layer="6" from-port="9" to-layer="8" to-port="2" />
		<edge from-layer="7" from-port="4" to-layer="8" to-port="0" />
		<edge from-layer="7" from-port="5" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="3" to-layer="11" to-port="0" />
		<edge from-layer="8" from-port="5" to-layer="11" to-port="2" />
		<edge from-layer="8" from-port="4" to-layer="11" to-port="1" />
		<edge from-layer="9" from-port="0" to-layer="11" to-port="3" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="4" />
		<edge from-layer="11" from-port="5" to-layer="14" to-port="0" />
		<edge from-layer="11" from-port="6" to-layer="14" to-port="1" />
		<edge from-layer="11" from-port="7" to-layer="14" to-port="2" />
		<edge from-layer="12" from-port="0" to-layer="14" to-port="3" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="4" />
		<edge from-layer="14" from-port="5" to-layer="15" to-port="0" />
		<edge from-layer="14" from-port="6" to-layer="15" to-port="1" />
		<edge from-layer="14" from-port="7" to-layer="15" to-port="2" />
		<edge from-layer="15" from-port="3" to-layer="16" to-port="0" />
	</edges>
	<rt_info>
		<add_attention_mask value="True" />
		<add_prefix_space />
		<add_special_tokens value="True" />
		<bos_token_id value="49406" />
		<clean_up_tokenization_spaces />
		<detokenizer_input_type value="i64" />
		<eos_token_id value="49407" />
		<handle_special_tokens_with_re />
		<max_length />
		<number_of_inputs value="1" />
		<openvino_tokenizers_version value="2025.2.0.1-567-7885335c24b" />
		<openvino_version value="2025.2.0-19140-c01cd93e24d-releases/2025/2" />
		<original_post_processor_template value="{&quot;type&quot;: &quot;RobertaProcessing&quot;, &quot;sep&quot;: [&quot;&lt;|endoftext|>&quot;, 49407], &quot;cls&quot;: [&quot;&lt;|startoftext|>&quot;, 49406], &quot;trim_offsets&quot;: false, &quot;add_prefix_space&quot;: false}" />
		<original_tokenizer_class value="&lt;class 'transformers.models.clip.tokenization_clip_fast.CLIPTokenizerFast'>" />
		<pad_token_id value="49407" />
		<sentencepiece_version value="0.2.0" />
		<skip_special_tokens value="True" />
		<streaming_detokenizer value="False" />
		<tiktoken_version value="0.9.0" />
		<tokenizer_output_type value="i64" />
		<tokenizers_version value="0.21.4" />
		<transformers_version value="4.53.3" />
		<use_max_padding value="False" />
		<use_sentencepiece_backend value="False" />
		<utf8_replace_mode value="replace" />
		<with_detokenizer value="True" />
	</rt_info>
</net>
